2024.12.17.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-17 Tue 14:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2024.12.10.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2024.12.24.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of December 10 to 17, 2024.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">Opam repository archival, Phase 1: unavailable packages</a></li>
<li><a href="#2">Proposed Package Archiving Policy for the opam Repository</a></li>
<li><a href="#3">QCheck 0.23</a></li>
<li><a href="#4">OCaml's Code of Conduct team - rotation of one team member</a></li>
<li><a href="#5">qcheck-lin and qcheck-stm 0.2</a></li>
<li><a href="#org5527793">Old CWN</a></li>
</ul>
</div>
</div>
<div id="outline-container-1" class="outline-2">
<h2 id="1">Opam repository archival, Phase 1: unavailable packages</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/opam-repository-archival-phase-1-unavailable-packages/15797/1">https://discuss.ocaml.org/t/opam-repository-archival-phase-1-unavailable-packages/15797/1</a>
</p>
</div>
<div id="outline-container-org8a8f65f" class="outline-3">
<h3 id="org8a8f65f">Hannes Mehnert announced</h3>
<div class="outline-text-3" id="text-org8a8f65f">
<p>
It is my pleasure to announce below the list of opam packages that will move to the opam-repository-archive on January 1st 2025. In total there are 4170 opam files scheduled for being moved within 561 unique packages. This decreases the size of the opam-repository by roughly 12.7%.
</p>

<p>
This list contains all packages (a) marked as "available: false" (which may have various reasons: security issue, source unavailable, &#x2026; - best to look into the "git log" for the specific package for the reason), and (b) packages which cannot be installed due to missing dependencies (with the packages mentioned in (a) being removed).
</p>

<p>
The second list of packages (b) has been automatically generated by the <a href="https://github.com/hannesm/archive-opam">archive-opam</a> utility - developed purely for the opam-repository archival project, and this utility may have bugs.
</p>

<p>
So, if you find a package in the list and you'd like to retain it in the opam-repository, there are some options:
</p>

<ul class="org-ul">
<li>(a) you can install it on your system (opam install &lt;pkg&gt;): this means there's a bug in the archive-opam utility, please provide the package name and version in the <a href="https://github.com/ocaml/opam-repository-archive/pull/3">opam-repository-archive Phase 1 PR</a>, together with your opam version, OCaml version, and operating system;</li>
<li>(b) it is not installable: please figure out the reasoning (the "Reasoning" may help you to find the root issue), and try to fix it yourself - if you're unable to fix the root cause, please also comment in the <a href="https://github.com/ocaml/opam-repository-archive/pull/3">opam-repository-archive Phase 1 PR</a> with the package name and version.</li>
</ul>

<p>
If you've any questions, please don't hesitate to ask here or on GitHub or via another communication channel.
</p>

<p>
You can help further on the archiving process:
</p>
<ul class="org-ul">
<li>as mentioned in the <a href="https://discuss.ocaml.org/t/proposed-package-archiving-policy-for-the-opam-repository/15713#p-67031-call-to-action-4">last announcement</a> please add the <a href="https://github.com/ocaml/opam-repository/blob/master/governance/policies/archiving.md#specification-of-the-x--fields-used-in-the-archiving-process"><code>x-maintenance-intent</code></a> to your packages (a good choice for a lot of packages is <code>x-maintenance-intent: [("latest")]</code> if you're maintaining the latest version only) - this will be considered in Phase 3 (March 1st 2025);</li>
<li>if you are the author or maintainer of a package that is no longer useful or maintained, you can as well mark your opam files in the opam-repository with <code>flags: deprecated</code> (this will be taken into account in Phase 3 - March 1st 2025);</li>
<li>if you flagged your preliminary releases with <code>flags: avoid-version</code>, and they can now be removed (e.g. since a stable version has been released), please open a pull request to replace the <code>avoid-version</code> with <code>deprecated</code>.</li>
</ul>

<p>
Please note that the next Phase will be announced on January 15th with all packages that are only installable with OCaml &lt; 4.08 - archiving is scheduled for February 1st.
</p>

<p>
To keep track of the announcements, please look at the <a href="https://discuss.ocaml.org/tag/opam-repository">opam-repository</a> tag.
</p>

<p>
You can reproduce these lists by running <code>opam-archive --unavailable --dry-run --later-installable --pkg-all</code> using opam-archive at 666a3b3886acfbcf82a7d73134247ccaa605510a and opam-repository at de786e28dbea73843ad5e5f0290a4e81fba39370.
</p>

<p>
A big thanks to the <a href="https://ocaml-sf.org">OCaml Software Foundation</a> for funding the opam-repository archival project.
</p>
</div>
<div id="outline-container-org9414c0a" class="outline-4">
<h4 id="org9414c0a">Packages scheduled for archiving (pkg-name: pkg-version[, pkg-version]*)</h4>
<div class="outline-text-4" id="text-org9414c0a">
<p>
<i>editor note</i> Please find this long list in the post itself: <a href="https://discuss.ocaml.org/t/opam-repository-archival-phase-1-unavailable-packages/15797">https://discuss.ocaml.org/t/opam-repository-archival-phase-1-unavailable-packages/15797</a>
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="2">Proposed Package Archiving Policy for the opam Repository</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/proposed-package-archiving-policy-for-the-opam-repository/15713/6">https://discuss.ocaml.org/t/proposed-package-archiving-policy-for-the-opam-repository/15713/6</a>
</p>
</div>
<div id="outline-container-org42f44a4" class="outline-3">
<h3 id="org42f44a4">Continuing this thread, Hannes Mehnert announced</h3>
<div class="outline-text-3" id="text-org42f44a4">
<p>
Hey,
</p>

<p>
just a quick update on the proposed roadmap. The changes are we don't do <code>avoid-version</code> / <code>deprecated</code> flag cleanups in Phase 1. Instead, we plan to remove packages with <code>deprecated</code> flag in Phase 3. Packages with flag <code>avoid-version</code> will stay in opam-repository, but we reach out to maintainers and authors whether their intention is to mark these packages as deprecated (e.g. for alpha / beta releases and release candidates).
</p>

<p>
Please find the updated roadmap below:
</p>

<ul class="org-ul">
<li>December 1st 2024: announcement of this proposal</li>
<li>December 15th 2024: announcement of the packages affected by Phase 1 (uninstallable packages (“available: false”, “opam admin check &#x2013;installability -i”)</li>
<li>January 1st 2025: Phase 1 cutting point: packages are moved to opam-repository-archive</li>
<li>January 15th 2025: announcement of the packages affected by Phase 2 (OCaml lower bound 4.08)</li>
<li>February 1st 2025: Phase 2 cutting point: packages are moved to opam-repository-archive</li>
<li>February 15th 2025: initial spring cleaning, announcement of packages (based on maintenance-intent), and <code>flags: deprecated</code></li>
<li>March 1st 2025: spring cleaning cutting point: packages are moved to opam-repository-archive</li>
<li>Every quarter: repeat Phase 3</li>
<li>Every year: reconsider Phase 2 with an increased OCaml lower bound</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="3">QCheck 0.23</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-qcheck-0-23/15790/1">https://discuss.ocaml.org/t/ann-qcheck-0-23/15790/1</a>
</p>
</div>
<div id="outline-container-org98281e9" class="outline-3">
<h3 id="org98281e9">Jan Midtgaard announced</h3>
<div class="outline-text-3" id="text-org98281e9">
<p>
I'm happy to announce the 0.23 release of <code>qcheck-core</code>, <code>qcheck</code>, <code>qcheck-alcotest</code>, and <code>qcheck-ounit</code>, along with a 0.5 release of <code>ppx_deriving_qcheck</code> :tada: 
</p>

<p>
The biggest user-visible change is the addition of a <a href="https://c-cube.github.io/qcheck/0.23/qcheck-core/index.html">qcheck-core overview documentation page</a> as well as clean-ups to the two module pages to provide a better overview of the different available features:
</p>
<ul class="org-ul">
<li><a href="https://c-cube.github.io/qcheck/0.23/qcheck-core/QCheck/index.html">QCheck</a></li>
<li><a href="https://c-cube.github.io/qcheck/0.23/qcheck-core/QCheck2/index.html">QCheck2</a></li>
</ul>

<p>
In more detail the 0.23 release has made the following changes:
</p>
<ul class="org-ul">
<li>Quote and escape in <code>Print.string</code> and <code>Print.char</code> in the <code>QCheck</code> module, mirroring the <code>QCheck2.Print</code> module's behaviour. Also quote and escape <code>Print.bytes</code> in both <code>QCheck</code> and <code>QCheck2</code>.</li>
<li>Clean-up <code>QCheck</code> and <code>QCheck2</code> documentation pages</li>
<li>Add <code>exponential</code> generator to <code>QCheck</code>, <code>QCheck.Gen</code>, and <code>QCheck2.Gen</code></li>
<li>Add <code>Shrink.bool</code> and use it in <code>QCheck.bool</code></li>
<li>Remove unread <code>fun_gen</code> field from <code>QCheck2</code>'s <code>fun_repr_tbl</code> type thereby silencing a compiler warning</li>
</ul>

<p>
The <code>ppx_deriving_qcheck</code> 0.5 release contains a fix to derive generators for mutually recursive data types involving records, thanks to a contribution from @Kakadu 
</p>

<p>
Happy testing! :smiley:
</p>
</div>
</div>
</div>
<div id="outline-container-4" class="outline-2">
<h2 id="4">OCaml's Code of Conduct team - rotation of one team member</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocamls-code-of-conduct-team-rotation-of-one-team-member/15791/1">https://discuss.ocaml.org/t/ocamls-code-of-conduct-team-rotation-of-one-team-member/15791/1</a>
</p>
</div>
<div id="outline-container-org54ee8ca" class="outline-3">
<h3 id="org54ee8ca">Sonja Heinze announced</h3>
<div class="outline-text-3" id="text-org54ee8ca">
<p>
A bit over two years ago, the OCaml community wrote and adopted a <a href="https://github.com/ocaml/code-of-conduct/blob/main/CODE_OF_CONDUCT.md">code of conduct</a> and put together a code of conduct team. The code of conduct team is there for anyone in the community whenever they have concerns about behavior that falls within the scope of the code of conduct. It's currently made up of @c-cube, @Khady, @mseri, @rjbou myself.
</p>

<p>
When putting together the code of conduct team, we mentioned that we'd rotate the team from time to time to keep it dynamic. We're now rotating one team member: I'm leaving the team and @shonfeder is joining. Thanks a lot, @shonfeder, for taking on this responsibility!
</p>

<p>
Let's also use this opportunity to explain how the Code of Conduct team operates: We generally do not step in on our own initiative, but only when asked. That's to avoid having five community members acting as a kind of "overarching community police". That said, we will step in without being asked in extreme cases, but this has not happened so far. We do moderate and/or act when people reach out to us. That does happen from time to time.
</p>

<p>
By the way, you can adopt the Code of Conduct yourself on your OCaml GitHub/GitLab repos by creating a `CODE_OF_CONDUCT.md`, containing the <a href="https://github.com/ocaml/code-of-conduct/blob/main/CODE_OF_CONDUCT_TEMPLATE.md">CODE_OF_CONDUCT_TEMPLATE</a> - full instructions <a href="https://github.com/ocaml/code-of-conduct?tab=readme-ov-file#adopting-this-code-of-conduct">here</a>. So far, it is already adopted on this discuss forum, the caml-list@inria.fr mailing list, the OCaml IRC, <a href="https://discord.com/invite/cCYQbqN">OCaml discord</a>, physical events like OCaml Workshop, and <a href="https://github.com/ocaml/code-of-conduct/blob/main/list-of-adopters.md">these repositories</a>. Absolutely everyone is welcome to adopt it on their OCaml repository as well. Adopting it doesn't have a practical effect in a big majority of cases, but it always makes contributors, particularly newcomers, feel more welcome.
</p>

<p>
Have a nice weekend everyone!
Best,
@pitag on behalf of the whole Code of Conduct team
</p>
</div>
</div>
</div>
<div id="outline-container-5" class="outline-2">
<h2 id="5">qcheck-lin and qcheck-stm 0.2</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-qcheck-lin-and-qcheck-stm-0-2/12301/4">https://discuss.ocaml.org/t/ann-qcheck-lin-and-qcheck-stm-0-2/12301/4</a>
</p>
</div>
<div id="outline-container-org55269fb" class="outline-3">
<h3 id="org55269fb">Jan Midtgaard announced</h3>
<div class="outline-text-3" id="text-org55269fb">
<p>
I just rolled a 0.5 release of <code>qcheck-lin</code>, <code>qcheck-stm</code>, and <code>qcheck-multicoretests-util</code>: <a href="https://github.com/ocaml-multicore/multicoretests/releases/tag/0.5">https://github.com/ocaml-multicore/multicoretests/releases/tag/0.5</a>
</p>

<p>
The biggest news in the 0.5 release is the addition of <code>Util.Pp.pp_fun_</code> for printing function values generated with QCheck.To ensure quoted and escaped output for chars and strings, this required bumping the <code>qcheck-core</code> lower bound to the freshly released <code>qcheck-core.0.23</code>. This in turn, enabled a couple of other clean-ups:
</p>

<ul class="org-ul">
<li>#492: Also use the new, upstreamed <code>Gen.exponential</code> combinator in STM</li>
<li>#491: Require <code>qcheck.0.23</code>, simplify show functions by utilizing it, and update expect outputs accordingly</li>
<li>#486: Add <code>Util.Pp.pp_fun_</code> printer for generated <code>QCheck.fun_</code> functions</li>
</ul>

<p>
Happy testing and happy holidays! :smiley: :christmas_tree:
</p>
</div>
</div>
</div>
<div id="outline-container-org5527793" class="outline-2">
<h2 id="org5527793">Old CWN</h2>
<div class="outline-text-2" id="text-org5527793">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe to the <a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a>.
</p>

<div class="authorname" id="orgd3a0c5f">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
